In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\lenovo\appdata\local\programs\python\python313\lib\site-packages (9.3.0)

In [2]:
import mysql.connector

# Connect to MySQL
conn = mysql.connector.connect(
    host='localhost',       # or your DB host
    user='root',            # replace with your username
    password='sabina2016', # replace with your password
    database='edu_institute'
)

In [3]:
cursor = conn.cursor()

In [4]:
cursor.execute("CREATE DATABASE IF NOT EXISTS edu_institute")

In [5]:
# Step 2: Create the table
create_table_query = """
CREATE TABLE IF NOT EXISTS students (
    student_id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    gender CHAR(1),
    enrollment_date DATE,
    program VARCHAR(50)
);
"""

In [6]:
cursor.execute(create_table_query)
print("Table 'students' created successfully (or already exists).")

cursor.close()
conn.close()

Table 'students' created successfully (or already exists).

In [7]:
import mysql.connector

# Connect to MySQL
conn = mysql.connector.connect(
    host='localhost',       # or your DB host
    user='root',            # replace with your username
    password='sabina2016', # replace with your password
    database='edu_institute'
)

In [8]:
cursor = conn.cursor()

In [10]:
insert_query = """
INSERT INTO students (student_id, name, age, gender, enrollment_date, program)
VALUES (%s, %s, %s, %s, %s, %s)
"""
student_data = ("1225", "Eliana", 22, "F", "2025-02-02", "Data Science")
student_data = ("1325", "Daisy", 21, "F", "2025-02-02", "Data Science")
student_data = ("1425", "Azariah", 20, "F", "2025-02-02", "Data Science")
student_data = ("1525", "Benson", 27, "M", "2025-02-02", "Full Stack")
student_data = ("1625", "Sunday", 28, "M", "2025-02-02", "A I")
student_data = ("1725", "Rose", 19, "F", "2025-02-02", "Data Science")
student_data = ("1828", "Blessing", 21, "F", "2025-02-02", "Artificial I")
cursor.execute(insert_query, student_data)
conn.commit()

In [11]:
select_query = """
SELECT * FROM students
WHERE program = 'Data Science';
"""

cursor.execute(select_query)

# Fetch and print results
results = cursor.fetchall()

for row in results:
    print(row)

(1225, 'Eliana', 22, 'F', datetime.date(2025, 2, 2), 'Data Science')
(1325, 'Daisy', 21, 'F', datetime.date(2025, 2, 2), 'Data Science')
(1425, 'Azariah', 20, 'F', datetime.date(2025, 2, 2), 'Data Science')
(1725, 'Rose', 19, 'F', datetime.date(2025, 2, 2), 'Data Science')

In [12]:
select_query = """
SELECT COUNT(*) AS total_student FROM students;
"""

cursor.execute(select_query)
result = cursor.fetchone()

print("Total students:", result[0])

Total students: 10

In [13]:
select_query = """
SELECT CURDATE() AS `Today's Date`;
"""

cursor.execute(select_query)
result = cursor.fetchone()

print("Today's Date:", result[0])

Today's Date: 2025-06-30

In [14]:
select_query = """
SELECT UPPER(name) AS student_name, enrollment_date
FROM students;
"""

cursor.execute(select_query)
results = cursor.fetchall()

for row in results:
    print("Name:", row[0], "| Enrollment Date:", row[1])

Name: ELIANA | Enrollment Date: 2025-02-02
Name: DAISY | Enrollment Date: 2025-02-02
Name: AZARIAH | Enrollment Date: 2025-02-02
Name: BENSON | Enrollment Date: 2025-02-02
Name: SUNDAY | Enrollment Date: 2025-02-02
Name: ROSE | Enrollment Date: 2025-02-02
Name: BARAKA | Enrollment Date: 0025-02-02
Name: BARAKA | Enrollment Date: 0025-02-02
Name: BARAKA | Enrollment Date: 2025-02-02
Name: BLESSING | Enrollment Date: 2025-02-02

In [15]:
select_query = """
SELECT UPPER(name) AS student_name, enrollment_date, CURRENT_DATE() AS `Today's Date`
FROM students;
"""

In [16]:
select_query = """
SELECT UPPER(name) AS student_name, enrollment_date
FROM students;
"""

cursor.execute(select_query)
results = cursor.fetchall()

for row in results:
    print("Name:", row[0], "| Enrollment Date:", row[1])

Name: ELIANA | Enrollment Date: 2025-02-02
Name: DAISY | Enrollment Date: 2025-02-02
Name: AZARIAH | Enrollment Date: 2025-02-02
Name: BENSON | Enrollment Date: 2025-02-02
Name: SUNDAY | Enrollment Date: 2025-02-02
Name: ROSE | Enrollment Date: 2025-02-02
Name: BARAKA | Enrollment Date: 0025-02-02
Name: BARAKA | Enrollment Date: 0025-02-02
Name: BARAKA | Enrollment Date: 2025-02-02
Name: BLESSING | Enrollment Date: 2025-02-02

In [17]:
cursor.execute("SELECT * FROM students")
rows = cursor.fetchall()

for row in rows:
    print(row)

(1225, 'Eliana', 22, 'F', datetime.date(2025, 2, 2), 'Data Science')
(1325, 'Daisy', 21, 'F', datetime.date(2025, 2, 2), 'Data Science')
(1425, 'Azariah', 20, 'F', datetime.date(2025, 2, 2), 'Data Science')
(1525, 'Benson', 27, 'M', datetime.date(2025, 2, 2), 'Full Stack')
(1625, 'Sunday', 28, 'M', datetime.date(2025, 2, 2), 'A I')
(1725, 'Rose', 19, 'F', datetime.date(2025, 2, 2), 'Data Science')
(1825, 'Baraka', 21, 'M', datetime.date(25, 2, 2), 'A I')
(1826, 'Baraka', 21, 'M', datetime.date(25, 2, 2), 'Artificial I')
(1827, 'Baraka', 21, 'M', datetime.date(2025, 2, 2), 'Artificial I')
(1828, 'Blessing', 21, 'F', datetime.date(2025, 2, 2), 'Artificial I')

In [18]:
student_list = [
    ("1225", "Eliana", 22, "F", "2025-02-02", "Data Science"),
    ("1325", "Daisy", 21, "F", "2025-02-02", "Data Science"),
    ("1425", "Azariah", 20, "F", "2025-02-02", "Data Science"),
    ("1525", "Benson", 27, "M", "2025-02-02", "Full Stack"),
    ("1625", "Sunday", 28, "M", "2025-02-02", "A I"),
    ("1725", "Rose", 19, "F", "2025-02-02", "Data Science"),
    ("1825", "Baraka", 21, "M", "2025-02-02", "Artificial I")
]

insert_query = """
INSERT INTO students (student_id, name, age, gender, enrollment_date, program)
VALUES (%s, %s, %s, %s, %s, %s)
"""

for student in student_list:
    try:
        cursor.execute(insert_query, student)
    except mysql.connector.IntegrityError:
        pass  # skip if already inserted

conn.commit()

In [19]:
cursor.execute("""
SELECT UPPER(name) AS student_name, enrollment_date
FROM students;
""")

for row in cursor.fetchall():
    print(row)

('ELIANA', datetime.date(2025, 2, 2))
('DAISY', datetime.date(2025, 2, 2))
('AZARIAH', datetime.date(2025, 2, 2))
('BENSON', datetime.date(2025, 2, 2))
('SUNDAY', datetime.date(2025, 2, 2))
('ROSE', datetime.date(2025, 2, 2))
('BARAKA', datetime.date(25, 2, 2))
('BARAKA', datetime.date(25, 2, 2))
('BARAKA', datetime.date(2025, 2, 2))
('BLESSING', datetime.date(2025, 2, 2))

In [20]:
select_query = """
SELECT program, COUNT(*) AS `Number of Students`
FROM students
GROUP BY program
ORDER BY `Number of Students` DESC;
"""

cursor.execute(select_query)
results = cursor.fetchall()

for row in results:
    print("Program:", row[0], "| Number of Students:", row[1])

Program: Data Science | Number of Students: 4
Program: Artificial I | Number of Students: 3
Program: A I | Number of Students: 2
Program: Full Stack | Number of Students: 1

In [21]:
select_query = """
SELECT name, age
FROM students
WHERE age = (SELECT MIN(age) FROM students);
"""

cursor.execute(select_query)
result = cursor.fetchall()

for row in result:
    print("Name:", row[0], "| Age:", row[1])

Name: Rose | Age: 19